#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "created-by"   = "fredrick-myrvoll"
          + "created-on"   = "2020-01-06"
          + "created-with" = "terraform"
          + "environment"  = "dev"
        }
      + location                    = "EUROPE-NORTH1"
      + name                        = "bulder-dev-example-slim"
      + project                     = "module-dev"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + age                   = 14
              + matches_storage_class = []
              + with_state            = "ARCHIVED"
            }
        }
      + lifecycle_rule {
          + action {
              + storage_class = "COLDLINE"
              + type          = "SetStorageClass"
            }

          + condition {
              + age                   = 7
              + matches_storage_class = [
                  + "STANDARD",
                ]
              + with_state            = "LIVE"
            }
        }

      + retention_policy {
          + is_locked        = false
          + retention_period = 604800
        }

      + versioning {
          + enabled = false
        }
    }

  # google_storage_bucket_iam_member.iam_read_members["serviceaccount:example@reader2.com"] will be created
  + resource "google_storage_bucket_iam_member" "iam_read_members" {
      + bucket = "bulder-dev-example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceaccount:example@reader2.com"
      + role   = "roles/storage.objectViewer"
    }

  # google_storage_bucket_iam_member.iam_read_members["user:example@reader.com"] will be created
  + resource "google_storage_bucket_iam_member" "iam_read_members" {
      + bucket = "bulder-dev-example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:example@reader.com"
      + role   = "roles/storage.objectViewer"
    }

  # google_storage_bucket_iam_member.iam_write_members["serviceaccount:example@writer2.com"] will be created
  + resource "google_storage_bucket_iam_member" "iam_write_members" {
      + bucket = "bulder-dev-example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceaccount:example@writer2.com"
      + role   = "roles/storage.objectCreator"
    }

  # google_storage_bucket_iam_member.iam_write_members["user:example@writer.com"] will be created
  + resource "google_storage_bucket_iam_member" "iam_write_members" {
      + bucket = "bulder-dev-example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:example@writer.com"
      + role   = "roles/storage.objectCreator"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
